class CalorieInfo {
  String? name;
  String? calories;
  String? carbohydrate;
  String? protein;
  String? fat;
  String? sugars;
  String? natrium;
  int number = 0;
  bool isPressed = false;
  bool isLiked = false;

  CalorieInfo(
      {required this.name,
        required this.calories,
        required this.carbohydrate,
        required this.protein,
        required this.fat,
        required this.sugars,
        required this.natrium});
}

var DB = [
  {
    "식품명": "흰쌀밥",
    "에너지": "405",
    "단백질": "8.37",
    "지방": "0.87",
    "탄수화물": "87.9",
    "당류": "0",
    "나트륨": "45",
  },
  {
    "식품명": "흑미밥",
    "에너지": "480",
    "단백질": "12",
    "지방": "3",
    "탄수화물": "105",
    "당류": "0",
    "나트륨": "0"
  },
  {
    "식품명": "꽃게탕",
    "에너지": "51",
    "단백질": "5.58",
    "지방": "1.23",
    "탄수화물": "4.32",
    "당류": "2.85",
    "나트륨": "819"
  },
  {
    "식품명": "낙지전골",
    "에너지": "153",
    "단백질": "19.5",
    "지방": "3.42",
    "탄수화물": "11.16",
    "당류": "0",
    "나트륨": "1452"
  },
  {
    "식품명": "동태국",
    "에너지": "51",
    "단백질": "7.26",
    "지방": "0.48",
    "탄수화물": "4.2",
    "당류": "0",
    "나트륨": "672"
  },
  {
    "식품명": "동태찌개",
    "에너지": "132",
    "단백질": "18.33",
    "지방": "4.11",
    "탄수화물": "5.16",
    "당류": "0.39",
    "나트륨": "819"
  },
  {
    "식품명": "돼지찌개",
    "에너지": "144",
    "단백질": "18.75",
    "지방": "4.53",
    "탄수화물": "6.78",
    "당류": "0.39",
    "나트륨": "765"
  },
  {
    "식품명": "된장찌개",
    "에너지": "138",
    "단백질": "10.14",
    "지방": "4.89",
    "탄수화물": "13.32",
    "당류": "0",
    "나트륨": "954"
  },
  {
    "식품명": "두부찌개",
    "에너지": "156",
    "단백질": "12.03",
    "지방": "7.89",
    "탄수화물": "9.54",
    "당류": "2.4",
    "나트륨": "543"
  },
  {
    "식품명": "매운탕",
    "에너지": "66",
    "단백질": "13.47",
    "지방": "1.2",
    "탄수화물": "0.57",
    "당류": "0",
    "나트륨": "750"
  },
  {
    "식품명": "버섯전골",
    "에너지": "234",
    "단백질": "15.42",
    "지방": "12.72",
    "탄수화물": "14.34",
    "당류": "3.54",
    "나트륨": "438"
  },
  {
    "식품명": "부대찌개",
    "에너지": "369",
    "단백질": "17.58",
    "지방": "19.47",
    "탄수화물": "30.81",
    "당류": "0.54",
    "나트륨": "717"
  },
  {
    "식품명": "샤브샤브",
    "에너지": "90",
    "단백질": "11.64",
    "지방": "2.7",
    "탄수화물": "4.71",
    "당류": "1.59",
    "나트륨": "153"
  },
  {
    "식품명": "닭튀김",
    "에너지": "969",
    "단백질": "56.58",
    "지방": "58.8",
    "탄수화물": "53.64",
    "당류": "11.13",
    "나트륨": "1230"
  },
  {
    "식품명": "떡강정",
    "에너지": "747",
    "단백질": "11.37",
    "지방": "14.16",
    "탄수화물": "143.67",
    "당류": "16.02",
    "나트륨": "1338"
  },
  {
    "식품명": "미역튀각",
    "에너지": "443",
    "단백질": "13.24",
    "지방": "33.9",
    "탄수화물": "21.14",
    "당류": "11.36",
    "나트륨": "5223"
  },
  {
    "식품명": "탕수육",
    "에너지": "116",
    "단백질": "6.65",
    "지방": "4.2",
    "탄수화물": "13.02",
    "당류": "6.44",
    "나트륨": "492"
  },
  {
    "식품명": "가지나물",
    "에너지": "36",
    "단백질": "1.42",
    "지방": "1.5",
    "탄수화물": "4.18",
    "당류": "2.34",
    "나트륨": "274"
  },
  {
    "식품명": "깻잎나물",
    "에너지": "78",
    "단백질": "2.68",
    "지방": "5.18",
    "탄수화물": "5.04",
    "당류": "2.04",
    "나트륨": "362"
  },
  {
    "식품명": "냉이나물",
    "에너지": "111",
    "단백질": "5.02",
    "지방": "3.07",
    "탄수화물": "15.7",
    "당류": "10.45",
    "나트륨": "718"
  },
  {
    "식품명": "버섯조림",
    "에너지": "60",
    "단백질": "4.38",
    "지방": "2",
    "탄수화물": "6.23",
    "당류": "1.95",
    "나트륨": "302"
  },
  {
    "식품명": "병어조림",
    "에너지": "112",
    "단백질": "12.46",
    "지방": "4.78",
    "탄수화물": "4.87",
    "당류": "0.22",
    "나트륨": "842"
  },
  {
    "식품명": "삼치조림",
    "에너지": "125",
    "단백질": "15.88",
    "지방": "5.63",
    "탄수화물": "2.61",
    "당류": "2.03",
    "나트륨": "441"
  },
  {
    "식품명": "어묵조림",
    "에너지": "159",
    "단백질": "5.83",
    "지방": "4.73",
    "탄수화물": "23.16",
    "당류": "2.43",
    "나트륨": "428"
  },
  {
    "식품명": "연근조림",
    "에너지": "174",
    "단백질": "2.68",
    "지방": "5.1",
    "탄수화물": "29.42",
    "당류": "2.78",
    "나트륨": "661"
  },
  {
    "식품명": "오징어조림",
    "에너지": "137",
    "단백질": "16.5",
    "지방": "2.37",
    "탄수화물": "12.45",
    "당류": "6.85",
    "나트륨": "1469"
  },
  {
    "식품명": "우엉조림",
    "에너지": "188",
    "단백질": "4.8",
    "지방": "3.33",
    "탄수화물": "34.8",
    "당류": "28.43",
    "나트륨": "1174"
  },
  {
    "식품명": "장조림",
    "에너지": "157",
    "단백질": "11.69",
    "지방": "5.39",
    "탄수화물": "15.56",
    "당류": "3.32",
    "나트륨": "877"
  },
  {
    "식품명": "코다리조림",
    "에너지": "86",
    "단백질": "16.46",
    "지방": "0.4",
    "탄수화물": "4.16",
    "당류": "3.67",
    "나트륨": "466"
  },
  {
    "식품명": "감자튀김",
    "에너지": "312",
    "단백질": "4.55",
    "지방": "17.0",
    "탄수화물": "35.15",
    "당류": "0.37",
    "나트륨": "78"
  },
  {
    "식품명": "잡채",
    "에너지": "146",
    "단백질": "4.71",
    "지방": "3.3",
    "탄수화물": "24.26",
    "당류": "0.73",
    "나트륨": "360"
  },
  {
    "식품명": "멸치조림",
    "에너지": "318",
    "단백질": "40.92",
    "지방": "13.22",
    "탄수화물": "8.93",
    "당류": "7.35",
    "나트륨": "3163"
  },
  {
    "식품명": "겉절이",
    "에너지": "55",
    "단백질": "2.28",
    "지방": "2.14",
    "탄수화물": "6.58",
    "당류": "1.3",
    "나트륨": "328"
  },
];

